# Wrangling with Stock Data Part 01

Apple (AAPL), Google (GOOG), SPDR S&P 500 ETF (SPY), SPDR Gold Shares (GLD), International Business Machines Corporation (IBM) stock data from https://finance.yahoo.com/ as csv format.

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Load and see whats inside the dataset

Lets start with Apple's (AAPL) stock data from its begening to `2018-12-19`.

Load Apple's stock data using `pandas` (`as pd`) `.read_csv()` method and see its first five (5) rows with `.head()` method.

In [2]:
df_aapl = pd.read_csv('data/AAPL.csv')
df_aapl.head()

         Date      Open      High       Low     Close  Adj Close       Volume
0  1980-12-12  0.513393  0.515625  0.513393  0.513393   0.023106  117258400.0
1  1980-12-15  0.488839  0.488839  0.486607  0.486607   0.021900   43971200.0
2  1980-12-16  0.453125  0.453125  0.450893  0.450893   0.020293   26432000.0
3  1980-12-17  0.462054  0.464286  0.462054  0.462054   0.020795   21610400.0
4  1980-12-18  0.475446  0.477679  0.475446  0.475446   0.021398   18362400.0

So Apple started its trading from `1980-12-12`

Lets see the last five rows of data using `.tail()` method.

In [3]:
df_aapl.tail()

,Date,Open,High,Low,Close,Adj Close,Volume
9583,2018-12-13,170.490005,172.570007,169.550003,170.949997,170.949997,31898600.0
9584,2018-12-14,169.000000,169.080002,165.279999,165.479996,165.479996,40703700.0
9585,2018-12-17,165.449997,168.350006,162.729996,163.940002,163.940002,44287900.0
9586,2018-12-18,165.380005,167.529999,164.389999,166.070007,166.070007,33795000.0
9587,2018-12-19,166.000000,167.440994,164.960007,166.350006,166.350006,14043718.0

In [4]:
print(f'Number of row present in the file: {len(df_aapl)}')

Number of row present in the file: 9588

You can access the column names using `.columns` attribute

In [5]:
df_aapl.columns

Index(['Date', 'Open', 'High', 'Low', 'Close', 'Adj Close', 'Volume'], dtype='object')

## Slice and Dice `pandas` `dataframe`

Lets selectc a single `row` and all `column`s some `x` using `.loc[]` method.

The implicit way:

In [6]:
df_aapl.loc[10,]

Date          1980-12-29
Open            0.642857
High            0.645089
Low             0.642857
Close           0.642857
Adj Close       0.028932
Volume       2.32904e+07
Name: 10, dtype: object

And

In [7]:
df_aapl.loc[10]

Date          1980-12-29
Open            0.642857
High            0.645089
Low             0.642857
Close           0.642857
Adj Close       0.028932
Volume       2.32904e+07
Name: 10, dtype: object

Select multiple `row`s and all `column`s

In [8]:
df_aapl.loc[[1,20,30], ]

          Date      Open      High       Low     Close  Adj Close      Volume
1   1980-12-15  0.488839  0.488839  0.486607  0.486607   0.021900  43971200.0
20  1981-01-13  0.546875  0.546875  0.544643  0.544643   0.024512   5762400.0
30  1981-01-27  0.575893  0.575893  0.571429  0.571429   0.025718   5924800.0

You can also select range of `row`s and all `column`s using `.loc[x:y, ]` method where `x` and `y` both are inclusive.

In [9]:
df_aapl.loc[0:5, ]

         Date      Open      High       Low     Close  Adj Close       Volume
0  1980-12-12  0.513393  0.515625  0.513393  0.513393   0.023106  117258400.0
1  1980-12-15  0.488839  0.488839  0.486607  0.486607   0.021900   43971200.0
2  1980-12-16  0.453125  0.453125  0.450893  0.450893   0.020293   26432000.0
3  1980-12-17  0.462054  0.464286  0.462054  0.462054   0.020795   21610400.0
4  1980-12-18  0.475446  0.477679  0.475446  0.475446   0.021398   18362400.0
5  1980-12-19  0.504464  0.506696  0.504464  0.504464   0.022704   12157600.0

And the explicit way, but [from the The Zen of Python](https://www.python.org/dev/peps/pep-0020/) __Explicit is better than implicit__.

`[#row, #column]` (:) -> all `row` or `column`.

In [10]:
df_aapl.loc[10, :]

Date          1980-12-29
Open            0.642857
High            0.645089
Low             0.642857
Close           0.642857
Adj Close       0.028932
Volume       2.32904e+07
Name: 10, dtype: object

In [11]:
df_aapl.loc[[1,20,30], :]

          Date      Open      High       Low     Close  Adj Close      Volume
1   1980-12-15  0.488839  0.488839  0.486607  0.486607   0.021900  43971200.0
20  1981-01-13  0.546875  0.546875  0.544643  0.544643   0.024512   5762400.0
30  1981-01-27  0.575893  0.575893  0.571429  0.571429   0.025718   5924800.0

In [12]:
df_aapl.loc[0:5, :]

         Date      Open      High       Low     Close  Adj Close       Volume
0  1980-12-12  0.513393  0.515625  0.513393  0.513393   0.023106  117258400.0
1  1980-12-15  0.488839  0.488839  0.486607  0.486607   0.021900   43971200.0
2  1980-12-16  0.453125  0.453125  0.450893  0.450893   0.020293   26432000.0
3  1980-12-17  0.462054  0.464286  0.462054  0.462054   0.020795   21610400.0
4  1980-12-18  0.475446  0.477679  0.475446  0.475446   0.021398   18362400.0
5  1980-12-19  0.504464  0.506696  0.504464  0.504464   0.022704   12157600.0

In [13]:
df_aapl.loc[0:5, 'Date']

0    1980-12-12
1    1980-12-15
2    1980-12-16
3    1980-12-17
4    1980-12-18
5    1980-12-19
Name: Date, dtype: object

In [14]:
df_aapl.loc[0:5, ['Date', 'Low']]

         Date       Low
0  1980-12-12  0.513393
1  1980-12-15  0.486607
2  1980-12-16  0.450893
3  1980-12-17  0.462054
4  1980-12-18  0.475446
5  1980-12-19  0.504464

In [15]:
df_aapl.loc[0:5, 'Date':'Low']

         Date      Open      High       Low
0  1980-12-12  0.513393  0.515625  0.513393
1  1980-12-15  0.488839  0.488839  0.486607
2  1980-12-16  0.453125  0.453125  0.450893
3  1980-12-17  0.462054  0.464286  0.462054
4  1980-12-18  0.475446  0.477679  0.475446
5  1980-12-19  0.504464  0.506696  0.504464

Some other ways to slice and dice `dataframe`

You can also select range of `row`s and all `column`s using `.loc[x : y]` method where `x` and `y` both are inclusive. (n.b: `.loc[x:y, ]`)

In [16]:
df_aapl.loc[10 : 15]

          Date      Open      High       Low     Close  Adj Close      Volume
10  1980-12-29  0.642857  0.645089  0.642857  0.642857   0.028932  23290400.0
11  1980-12-30  0.629464  0.629464  0.627232  0.627232   0.028229  17220000.0
12  1980-12-31  0.611607  0.611607  0.609375  0.609375   0.027425   8937600.0
13  1981-01-02  0.616071  0.620536  0.616071  0.616071   0.027727   5415200.0
14  1981-01-05  0.604911  0.604911  0.602679  0.602679   0.027124   8932000.0
15  1981-01-06  0.578125  0.578125  0.575893  0.575893   0.025919  11289600.0

Selectc a single `row` and all `column`s using `[x:y]` where `x` (inclusive)  `y` (exclusive).

In [17]:
df_aapl[10:11]

          Date      Open      High       Low     Close  Adj Close      Volume
10  1980-12-29  0.642857  0.645089  0.642857  0.642857   0.028932  23290400.0

Selectc ranges of `row`s and all `column`s.

In [18]:
df_aapl[10: 16]

          Date      Open      High       Low     Close  Adj Close      Volume
10  1980-12-29  0.642857  0.645089  0.642857  0.642857   0.028932  23290400.0
11  1980-12-30  0.629464  0.629464  0.627232  0.627232   0.028229  17220000.0
12  1980-12-31  0.611607  0.611607  0.609375  0.609375   0.027425   8937600.0
13  1981-01-02  0.616071  0.620536  0.616071  0.616071   0.027727   5415200.0
14  1981-01-05  0.604911  0.604911  0.602679  0.602679   0.027124   8932000.0
15  1981-01-06  0.578125  0.578125  0.575893  0.575893   0.025919  11289600.0

## Finding some global statistic 

for more info: https://pandas.pydata.org/pandas-docs/stable/api.html#api-dataframe-stats

for a single column

In [19]:
df_aapl['Close'].min()

0.196429

for multiple column

In [20]:
df_aapl[['Close', 'High']].max()

Close    232.070007
High     233.470001
dtype: float64

for a entire dataframe

In [21]:
df_aapl.max()

Date          2018-12-19
Open              230.78
High              233.47
Low               229.78
Close             232.07
Adj Close        231.263
Volume       1.85541e+09
dtype: object

In [22]:
df_aapl.describe()

,Open,High,Low,Close,Adj Close,Volume
count,9587.000000,9587.000000,9587.000000,9587.000000,9587.000000,9.587000e+03
mean,26.203401,26.453499,25.935684,26.199675,22.588905,8.760686e+07
std,46.769799,47.164681,46.357703,46.768654,44.732433,8.679086e+07
min,0.198661,0.198661,0.196429,0.196429,0.008840,3.472000e+05
25%,1.049286,1.071429,1.031250,1.050000,0.148731,3.403945e+07
50%,1.662946,1.696429,1.633929,1.664286,0.881922,5.951400e+07
75%,25.742142,26.057142,25.270714,25.700714,17.210811,1.092752e+08
max,230.779999,233.470001,229.779999,232.070007,231.263092,1.855410e+09

Look `pandas` knows it is not necessary to calculate stats for `Date`.

## Some utility functions

In [23]:
COMPANIES = ['SPY', 'GLD', 'AAPL', 'IBM', 'GOOG' ]
stats = ['max', 'min', 'std']

In [24]:
def get_stats(company_sym, parm ,func):
    df = pd.read_csv(f'data/{company_sym}.csv')                              # format string
    return df[parm].apply(func)

In [25]:
print('Closing price for some companies: \n')
for sym in COMPANIES:
    for stat in stats:
        print(f"{sym} \t {stat} \t {get_stats(sym, 'Close', stat):.3f}")     # format string
    print()

Closing price for some companies:

SPY 	 max 	 293.580
SPY 	 min 	 43.406
SPY 	 std 	 56.512

GLD 	 max 	 184.590
GLD 	 min 	 41.260
GLD 	 std 	 34.017

AAPL 	 max 	 232.070
AAPL 	 min 	 0.196
AAPL 	 std 	 46.769

IBM 	 max 	 215.800
IBM 	 min 	 4.080
IBM 	 std 	 56.839

GOOG 	 max 	 1268.330
GOOG 	 min 	 49.682
GOOG 	 std 	 292.462

Lets see when they started their trading

In [26]:
for sym in COMPANIES:
    df = pd.read_csv(f'data/{sym}.csv')
    print(f"{sym} started trading from:\t {df.loc[0, 'Date']}\n")

SPY started trading from:	 1993-01-29

GLD started trading from:	 2004-11-18

AAPL started trading from:	 1980-12-12

IBM started trading from:	 1962-01-02

GOOG started trading from:	 2004-08-19

Ok lets align all of them from there common date.

First make a dummy `series` from `2001` to `2017`

In [27]:
start_date = '2001-01-01'
end_date = '2017-12-31'
dates = pd.date_range(start_date, end_date)

dates

DatetimeIndex(['2001-01-01', '2001-01-02', '2001-01-03', '2001-01-04',
               '2001-01-05', '2001-01-06', '2001-01-07', '2001-01-08',
               '2001-01-09', '2001-01-10',
               ...
               '2017-12-22', '2017-12-23', '2017-12-24', '2017-12-25',
               '2017-12-26', '2017-12-27', '2017-12-28', '2017-12-29',
               '2017-12-30', '2017-12-31'],
              dtype='datetime64[ns]', length=6209, freq='D')

Now make a `dataframe` with `dates` as its index

In [28]:
df_2001_2017 = pd.DataFrame(index=dates)

df_2001_2017.head()

Empty DataFrame
Columns: []
Index: [2001-01-01 00:00:00, 2001-01-02 00:00:00, 2001-01-03 00:00:00, 2001-01-04 00:00:00, 2001-01-05 00:00:00]

Using `SPY` as refference for trading date lets join `df_2001_2017` and `SPY` (`Adj Close`)

In [29]:
df_spy = pd.read_csv('data/SPY.csv')

In [30]:
df_2001_2017 = df_2001_2017.join(df_spy)

In [31]:
df_2001_2017.head()

                    Date  Open  High  Low  Close  Adj Close  Volume
2001-01-01 00:00:00  NaN   NaN   NaN  NaN    NaN        NaN     NaN
2001-01-02 00:00:00  NaN   NaN   NaN  NaN    NaN        NaN     NaN
2001-01-03 00:00:00  NaN   NaN   NaN  NaN    NaN        NaN     NaN
2001-01-04 00:00:00  NaN   NaN   NaN  NaN    NaN        NaN     NaN
2001-01-05 00:00:00  NaN   NaN   NaN  NaN    NaN        NaN     NaN

ow ow ow we didnt tell for `Adj Close`. Lets do it again.

In [32]:
df_2001_2017 = pd.DataFrame(index=dates)

Load `SPY` `dataframe` with `Date`, `Adj Close` `series`, `Date` as its index and parse date as `pandas` `datetime` format.

In [33]:
df_spy = pd.read_csv('data/SPY.csv', index_col='Date', parse_dates=True, usecols=['Date', 'Adj Close'], na_values=['nan'])

df_spy.head()

            Adj Close
Date
1993-01-29  27.112253
1993-02-01  27.305082
1993-02-02  27.362904
1993-02-03  27.652185
1993-02-04  27.767893

Now join `df_2001_2017` with `df_spy`

In [34]:
df_2001_2017 = df_2001_2017.join(df_spy)

df_2001_2017.head(10)

            Adj Close
2001-01-01        NaN
2001-01-02  91.708443
2001-01-03  96.113632
2001-01-04  95.079018
2001-01-05  91.975456
2001-01-06        NaN
2001-01-07        NaN
2001-01-08  92.687393
2001-01-09  92.442589
2001-01-10  94.066788

`NaN`s where day off. Remove all `row`s with `NaN`.

In [35]:
df_2001_2017 = df_2001_2017.dropna()

df_2001_2017.head()

            Adj Close
2001-01-02  91.708443
2001-01-03  96.113632
2001-01-04  95.079018
2001-01-05  91.975456
2001-01-08  92.687393

Joining two `dataframe` and remove all the `NaN` `row`s it took two steps. But we can do this in a single steps. Lets do it again.

In [36]:
df_2001_2017 = pd.DataFrame(index=dates)
df_2001_2017 = df_2001_2017.join(df_spy, how='inner')

df_2001_2017.head()

            Adj Close
2001-01-02  91.708443
2001-01-03  96.113632
2001-01-04  95.079018
2001-01-05  91.975456
2001-01-08  92.687393

Ok, make a dataframe with `Adj Close` values from all the companies data.

In [37]:
def company_XYZ(company_sym, xyz):
    df = pd.read_csv(f'data/{company_sym}.csv', index_col='Date', parse_dates=True, usecols=['Date', xyz], na_values=['nan'])
    df = df.rename(columns={xyz: company_sym})
    return df

In [38]:
def XYZ_df(xyz, start_date, end_date):
    date_ranges = pd.date_range(start_date, end_date)
    new_df = pd.DataFrame(index=date_ranges)

    for sym in COMPANIES:
        df = company_XYZ(sym, xyz)
        new_df = new_df.join(df, how='inner')
    return new_df

In [39]:
xyz = 'Adj Close'
start_date = '1960-01-01'
end_date = '2017-12-31'

adj_close_df = XYZ_df(xyz, start_date, end_date)
adj_close_df.head()

                  SPY        GLD      AAPL        IBM       GOOG
2004-11-18  89.663284  44.380001  2.649473  67.794075  83.228676
2004-11-19  88.666519  44.779999  2.638950  67.330704  84.152664
2004-11-22  89.089394  44.950001  2.934558  67.801186  82.016563
2004-11-23  89.225304  44.750000  2.930731  67.922371  83.218742
2004-11-24  89.436737  45.049999  3.063707  68.050690  86.815353

In [40]:
#--->